xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_LS2224_1A1D_AUO_M215HTN01_DOT_1.h
//==================================================================
// Version Code of NVRam
//==================================================================
#define _CHECKSUM                                               0x27
#define _VERSION_CODE                                           0x48

//==================================================================
//  For Lenovo Fac Define
//==================================================================
#define _OWNER_NONE                                             0
#define _OWNER_RTK                                              1
#define _OWNER_TPV                                              2
#define _OWNER_FOXCONN                                          3
#define _OWNER_WISTRON       					                4

#define _FACTORY_MODE_OWNER                                     _OWNER_TPV

//==================================================================
//_b0_~_b9_ only for Lenovo Green OSD
//==================================================================
#define _MODEL_NAME                                             _bL_, _bS_, _b2_, _b2_, _b2_, _b4_
#define _MICROCODE                                              _bL_,_bA_, _b0_, _DOT, _b1_

#define _FACTORY_PROJECT_NAME                                   _L,_S,_2,_2,_2,_4
#define _FW_RELEASE_DATE                                        _2,_0,_1,_6,_0,_5,_1,_0
#define _FW_VERSION                                             _L,_A,_0,_DOT,_1
#define _DDCCI_FIRMWARE_VERSION							        0x0001  //Ver 0.07	
#define _IC_SERIES                                      		_R,_T,_D,_2,_2,_8,_1,_E,_L

#define _PANNEL_NAME 											'M','2','1','5','H','T','N','0','1'

//==================================================================
// Digital Port Setting for OSD Input source switch sub menu.
// Description  : The _DVI_PORT,_HDMI_PORT,_DP_PORT,_NONE_PORT defines can't be changed.
//==================================================================
#define _DVI_PORT                                               2//_SOURCE_DVI
#define _HDMI_PORT                                              3//_SOURCE_HDMI
#define _DP_PORT                                                4//_SOURCE_DP
#define _NONE_PORT                                              5//_SOURCE_NONE

#define _INPUT_PORT_MAX                                         2
#define _DIGITAL1_TYPE                                          _DVI_PORT
#define _DIGITAL2_TYPE                                          _NONE_PORT

//==================================================================
// Definitions for Language Logo setting 
//==================================================================
#define _NONE_LOGO                                              0
#define _IBM_THINKVISION_LENOVO                                 1
#define _LENOVO                                                 2
#define _LENOVO_THINKVISION										3
#define _LENOVO_THINKVISION_EPA									4
#define _LENOVO_2015                                            5
#define _LENOVO_2015_EPA                                        6

#define _LOGO_TYPE                                              _LENOVO_2015_EPA//_LENOVO

#if((_LOGO_TYPE == _IBM_THINKVISION_LENOVO) || (_LOGO_TYPE == _LENOVO))
#define _EPA_LOGO                                               _ON
#else
#define _EPA_LOGO                                               _OFF
#endif

//==================================================================
// Definitions for Language Type setting 
//==================================================================
#define _8_LAN                                                  0   //_ENGLISH,_FRENCH,_ITALIAN,_CHINESE_S,_SPANISH,_JAPAN,_GERMAN,_RUSSIAN,
#define _2_LAN                                                  1   //_CHINESE_S,_ENGLISH

#define _LANGUAGE_TYPE                                          _8_LAN

//==================================================================
// Definitions for Language default setting
//==================================================================
#define _LANGUAGE_DEFAULT                                        _ENGLISH

//==================================================================
// Definitions for Panel Contrast
//==================================================================
#define _COLOR_TEMP_DEF                                         _CT_6500

#define MAX_CONTRAST_RATIO                                      118 // 1.75(unit 1/100)
#define DEF_CONTRAST_RATIO                                      100 // 1.00(unit 1/100)
#define MIN_CONTRAST_RATIO                                      40//15  // 0.5(unit 1/100)
#define _OSD_CONTRAST_DEF_VALUE                                 80  //_CONTRAST_VGA
#define _OSD_BRIGHTNESS_DEF_VALUE                               80

#define _LOW_BLUE_LIGHT_FUNCTION                                _ON

#if(_LOW_BLUE_LIGHT_FUNCTION == _ON)
#define _LBL_CONTRAST_DEF                               		_OSD_CONTRAST_DEF_VALUE    
#define _LBL_BRIGHTNESS_DEF                             		40

#define _OSD_LBL_H_POS                                  		902
#define _OSD_LBL_V_POS                                  		8
#endif

//==================================================================
// Brightness PWM Table
//==================================================================
#define _PWM_B00                                                0x58 //|00
#define _PWM_B10                                                0x59 //|10
#define _PWM_B20                                                0x5B //|20
#define _PWM_B30                                                0x63 //|30
#define _PWM_B40                                                0x6D //|40
#define _PWM_B50                                                0x7B //|50
#define _PWM_B60                                                0x8D //|60
#define _PWM_B70                                                0xAC //0x9A //|70
#define _PWM_B80                                                0xCB //0xBF //|80
#define _PWM_B90                                                0xE5 //0xDE //|90
#define _PWM_B100                                               0xFF //|100

#define MIN_BACKLIGHT_PWM                                       _PWM_B00
//-----------------------------------------------------------------------------------------------------------
#if((_PWM_B50>_PWM_B60)||(_PWM_B60>_PWM_B70)||(_PWM_B70>_PWM_B80)||(_PWM_B80>_PWM_B90)||(_PWM_B90>_PWM_B100))
  #error: PWM data error!!!
#endif

